# Chuck Norris programmer facts (Italiano)
fact.count=82
fact.0=Tutti gli array dichiarati da Chuck Norris sono di dimensione infinita, perch\u00e9 Chuck Norris non conosce limiti.
fact.1=Chuck Norris non ha latenza del disco perch\u00e9 l'hard drive sa che deve sbrigarsi.
fact.2=Tutti i browser supportano le definizioni esadecimali #chuck e #norris per i colori nero e blu.
fact.3=Chuck Norris non pu\u00f2 testare l'uguaglianza perch\u00e9 non ha eguali.
fact.4=Chuck Norris non ha bisogno del garbage collection perch\u00e9 non chiama .Dispose(), chiama .DropKick().
fact.5=Il primo programma di Chuck Norris \u00e8 stato kill -9.
fact.6=Chuck Norris ha fatto scoppiare la bolla delle dot com.
fact.7=Chuck Norris scrive codice che si ottimizza da solo.
fact.8=Chuck Norris pu\u00f2 scrivere funzioni ricorsive infinite... e farle ritornare.
fact.9=Chuck Norris pu\u00f2 risolvere le Torri di Hanoi in una sola mossa.
fact.10=L'unico pattern che Chuck Norris conosce \u00e8 God Object.
fact.11=Chuck Norris ha completato World of Warcraft.
fact.12=I project manager non chiedono mai stime a Chuck Norris... mai.
fact.13=Chuck Norris non usa gli standard web perch\u00e9 il web si adatta a lui.
fact.14="Funziona sulla mia macchina" \u00e8 sempre vero per Chuck Norris.
fact.15=Le lavagne sono bianche perch\u00e9 Chuck Norris le ha spaventate.
fact.16=La barba di Chuck Norris pu\u00f2 digitare 140 parole al minuto.
fact.17=Chuck Norris pu\u00f2 fare unit test di un'intera applicazione con un singolo assert.
fact.18=Chuck Norris non va a caccia di bug, perch\u00e9 ci\u00f2 implica una probabilit\u00e0 di fallimento. Lui li elimina direttamente.
fact.19=La tastiera di Chuck Norris non ha il tasto Ctrl perch\u00e9 niente controlla Chuck Norris.
fact.20=Chuck Norris non ha bisogno di un debugger, fissa il bug finch\u00e9 il codice non confessa.
fact.21=Chuck Norris pu\u00f2 accedere ai metodi privati.
fact.22=Chuck Norris pu\u00f2 istanziare una classe astratta.
fact.23=Chuck Norris non ha bisogno di conoscere il pattern factory. Pu\u00f2 istanziare le interfacce.
fact.24=L'oggetto classe eredita da Chuck Norris.
fact.25=Per Chuck Norris, NP-Hard \= O(1).
fact.26=Chuck Norris conosce l'ultima cifra di PI.
fact.27=Chuck Norris pu\u00f2 dividere per zero.
fact.28=Chuck Norris non riceve errori di compilazione, il linguaggio si modifica da solo per adattarsi a Chuck Norris.
fact.29=I programmi scritti da Chuck Norris non hanno numeri di versione perch\u00e9 li scrive una sola volta. Se un utente segnala un bug o richiede una funzionalit\u00e0, non sopravvive fino al tramonto.
fact.30=Chuck Norris non crede nei numeri in virgola mobile perch\u00e9 non possono essere digitati sulla sua tastiera binaria.
fact.31=Chuck Norris ha risolto il problema del Commesso Viaggiatore in tempo O(1).
fact.32=Chuck Norris non riceve mai un errore di sintassi. Invece, il linguaggio riceve un errore DoesNotConformToChuck.
fact.33=Nessuna istruzione pu\u00f2 catturare la ChuckNorrisException.
fact.34=Chuck Norris non programma con una tastiera. Fissa il computer finch\u00e9 non fa quello che vuole.
fact.35=Chuck Norris non fa pair programming.
fact.36=Chuck Norris pu\u00f2 scrivere applicazioni multi-thread con un singolo thread.
fact.37=Non c'\u00e8 il tasto Esc sulla tastiera di Chuck Norris, perch\u00e9 nessuno sfugge a Chuck Norris.
fact.38=Chuck Norris non cancella i file, li spazza via.
fact.39=Chuck Norris pu\u00f2 fare una ricerca binaria su dati non ordinati.
fact.40=Chuck Norris decifra codici RSA a 128 bit in millisecondi.
fact.41=Chuck Norris \u00e8 uscito da un ciclo infinito.
fact.42=Chuck Norris pu\u00f2 leggere tutti i dati crittografati, perch\u00e9 niente pu\u00f2 nascondersi da Chuck Norris.
fact.43=L'hosting di Chuck Norris garantisce il 101% di uptime.
fact.44=Quando un bug vede Chuck Norris, fugge urlando di terrore e si autodistrugge per evitare un calcio rotante.
fact.45=Chuck Norris ha riscritto il motore di ricerca di Google da zero.
fact.46=Chuck Norris non ha bisogno del cloud per scalare le sue applicazioni, usa il suo portatile.
fact.47=Chuck Norris pu\u00f2 accedere al DB dalla UI.
fact.48=Il protocollo di Chuck Norris non ha stati, richieste o risposte, solo comandi.
fact.49=I programmi di Chuck Norris occupano il 150% della CPU, anche quando non sono in esecuzione.
fact.50=Chuck Norris pu\u00f2 generare thread che terminano prima di essere avviati.
fact.51=I programmi di Chuck Norris non accettano input.
fact.52=Chuck Norris non ha bisogno di un sistema operativo.
fact.53=Chuck Norris pu\u00f2 compilare errori di sintassi.
fact.54=Chuck Norris comprime i suoi file con un calcio rotante volante all'hard drive.
fact.55=Chuck Norris non usa un computer perch\u00e9 un computer fa tutto pi\u00f9 lentamente di Chuck Norris.
fact.56=Non sei tu a disabilitare il plug-in di Chuck Norris, \u00e8 lui che disabilita te.
fact.57=Chuck Norris non ha bisogno di un compilatore Java, va direttamente al .war
fact.58=Chuck Norris pu\u00f2 usare GOTO quanto vuole. Dirgli il contrario \u00e8 considerato pericoloso.
fact.59=Non c'\u00e8 niente di regolare nelle espressioni di Chuck Norris.
fact.60=La crittografia quantistica non funziona con Chuck Norris. Quando qualcosa viene osservato da Chuck, resta nello stesso stato finch\u00e9 lui non ha finito.
fact.61=Non serve provare a catturare le eccezioni di Chuck Norris; ogni singolo lancio che fa \u00e8 fatale.
fact.62=La barba di Chuck Norris \u00e8 immutabile.
fact.63=L'IDE preferito di Chuck Norris \u00e8 hexedit.
fact.64=Chuck Norris \u00e8 immutabile. Se qualcosa deve cambiare, dovr\u00e0 essere il resto dell'universo.
fact.65=L'operatore di addizione di Chuck Norris non \u00e8 commutativo; si teletrasporta dove lui ne ha bisogno.
fact.66=I metodi anonimi e i tipi anonimi si chiamano tutti Chuck Norris. Semplicemente non amano vantarsi.
fact.67=Chuck Norris non ha colli di bottiglia nelle prestazioni. Fa semplicemente aspettare l'universo il suo turno.
fact.68=Chuck Norris non usa le eccezioni quando programma. Non \u00e8 riuscito a trovare nessuna parte del suo codice che non sia eccezionale.
fact.69=Quando il codice di Chuck Norris non compila, il compilatore si scusa.
fact.70=Chuck Norris non usa software di controllo versione. Nessuno dei suoi codici ha mai avuto bisogno di revisione.
fact.71=Chuck Norris pu\u00f2 recitare il pi greco. Al contrario.
fact.72=Quando Chuck Norris punta a null, null trema di paura.
fact.73=Chuck Norris ha accesso root al tuo sistema.
fact.74=Quando Chuck Norris passa un argomento a un metodo, il metodo perde.
fact.75=La tastiera di Chuck Norris non ha il tasto F1, \u00e8 il computer che chiede aiuto a lui.
fact.76=Chuck Norris \u00e8 troppo duro per le soft delete.
fact.77=Chuck Norris non fa grafici Burn Down, fa grafici Smack Down.
fact.78=Chuck Norris pu\u00f2 eliminare il Cestino.
fact.79=Quando Chuck Norris preme Ctrl+Alt+Canc, si avvia il riavvio di tutti i computer del mondo.
fact.80=Quando Chuck Norris lancia eccezioni, le lancia attraverso la stanza.
fact.81=Quando Chuck Norris naviga in internet, i siti web ricevono il messaggio "Attenzione\: Internet Explorer ha stabilito che questo utente \u00e8 pericoloso. Procedere?".
