# Chuck Norris programmer facts (Sloven\u010dina)
fact.count=82
fact.0=V\u0161etky po\u013ea, ktor\u00e9 Chuck Norris deklaruje, maj\u00fa nekone\u010dn\u00fa ve\u013ekos\u0165, preto\u017ee Chuck Norris nepozn\u00e1 \u017eiadne hranice.
fact.1=Chuck Norris nem\u00e1 latenciu disku, preto\u017ee pevn\u00fd disk vie, \u017ee sa m\u00e1 do \u010derta popon\u00e1h\u013ea\u0165.
fact.2=V\u0161etky prehliada\u010de podporuj\u00fa hex defin\u00edcie #chuck a #norris pre farby \u010diernu a modr\u00fa.
fact.3=Chuck Norris nem\u00f4\u017ee testova\u0165 rovnos\u0165, preto\u017ee nem\u00e1 sebe rovn\u00e9ho.
fact.4=Chuck Norris nepotrebuje garbage collection, preto\u017ee nevol\u00e1 .Dispose(), vol\u00e1 .DropKick().
fact.5=Prv\u00fd program Chucka Norrisa bol kill -9.
fact.6=Chuck Norris sp\u00f4sobil prasknutie dot-com bubliny.
fact.7=Chuck Norris p\u00ed\u0161e k\u00f3d, ktor\u00fd sa s\u00e1m optimalizuje.
fact.8=Chuck Norris dok\u00e1\u017ee nap\u00edsa\u0165 nekone\u010dn\u00e9 rekurz\u00edvne funkcie... a necha\u0165 ich vr\u00e1ti\u0165.
fact.9=Chuck Norris dok\u00e1\u017ee vyrie\u0161i\u0165 Hanojsk\u00e9 ve\u017ee jedn\u00fdm \u0165ahom.
fact.10=Jedin\u00fd n\u00e1vrhov\u00fd vzor, ktor\u00fd Chuck Norris pozn\u00e1, je God Object.
fact.11=Chuck Norris dokon\u010dil World of Warcraft.
fact.12=Projektov\u00ed mana\u017e\u00e9ri nikdy ne\u017eiadaj\u00fa od Chucka Norrisa odhady... nikdy.
fact.13=Chuck Norris nepou\u017e\u00edva webov\u00e9 \u0161tandardy, preto\u017ee web sa prisp\u00f4sob\u00ed jemu.
fact.14="Funguje to na mojom po\u010d\u00edta\u010di" plat\u00ed pre Chucka Norrisa v\u017edy.
fact.15=Tabule s\u00fa biele, preto\u017ee ich Chuck Norris tak vystra\u0161il.
fact.16=Brada Chucka Norrisa dok\u00e1\u017ee p\u00edsa\u0165 r\u00fdchlos\u0165ou 140 slov za min\u00fatu.
fact.17=Chuck Norris dok\u00e1\u017ee otestova\u0165 cel\u00fa aplik\u00e1ciu jedn\u00fdm assertom.
fact.18=Chuck Norris nelov\u00ed chyby, to by znamenalo pravdepodobnos\u0165 ne\u00faspechu. On chyby zab\u00edja.
fact.19=Kl\u00e1vesnica Chucka Norrisa nem\u00e1 kl\u00e1ves Ctrl, preto\u017ee ni\u010d neovl\u00e1da Chucka Norrisa.
fact.20=Chuck Norris nepotrebuje debugger, jednoducho sa na chybu zazer\u00e1, k\u00fdm sa k\u00f3d neprizn\u00e1.
fact.21=Chuck Norris m\u00e1 pr\u00edstup k priv\u00e1tnym met\u00f3dam.
fact.22=Chuck Norris dok\u00e1\u017ee vytvori\u0165 in\u0161tanciu abstraktnej triedy.
fact.23=Chuck Norris nepotrebuje pozna\u0165 vzor class factory. Dok\u00e1\u017ee vytvori\u0165 in\u0161tanciu rozhran\u00ed.
fact.24=Trieda object ded\u00ed od Chucka Norrisa.
fact.25=Pre Chucka Norrisa je NP-Hard \= O(1).
fact.26=Chuck Norris pozn\u00e1 posledn\u00fa \u010d\u00edslicu \u010d\u00edsla PI.
fact.27=Chuck Norris dok\u00e1\u017ee deli\u0165 nulou.
fact.28=Chuck Norris nedost\u00e1va chyby kompil\u00e1tora, jazyk sa s\u00e1m zmen\u00ed, aby vyhovoval Chuckovi Norrisovi.
fact.29=Programy, ktor\u00e9 Chuck Norris p\u00ed\u0161e, nemaj\u00fa \u010d\u00edsla verzi\u00ed, preto\u017ee ich p\u00ed\u0161e len raz. Ak pou\u017e\u00edvate\u013e nahl\u00e1si chybu alebo m\u00e1 po\u017eiadavku na funkciu, ned\u00f4\u017eije sa z\u00e1padu slnka.
fact.30=Chuck Norris never\u00ed na \u010d\u00edsla s pohyblivou desatinnou \u010diarkou, preto\u017ee sa nedaj\u00fa nap\u00edsa\u0165 na jeho bin\u00e1rnej kl\u00e1vesnici.
fact.31=Chuck Norris vyrie\u0161il probl\u00e9m obchodn\u00e9ho cestuj\u00faceho v \u010dase O(1).
fact.32=Chuck Norris nikdy nedostane syntaktick\u00fa chybu. Namiesto toho jazyk dostane chybu DoesNotConformToChuck.
fact.33=\u017diadny v\u00fdraz ned\u00f4k\u00e1\u017ee zachyti\u0165 v\u00fdnimku ChuckNorrisException.
fact.34=Chuck Norris neprogramuje pomocou kl\u00e1vesnice. Pozer\u00e1 sa na po\u010d\u00edta\u010d, k\u00fdm ten neurob\u00ed, \u010do chce.
fact.35=Chuck Norris nerob\u00ed p\u00e1rov\u00e9 programovanie.
fact.36=Chuck Norris dok\u00e1\u017ee p\u00edsa\u0165 viacvl\u00e1knov\u00e9 aplik\u00e1cie s jedn\u00fdm vl\u00e1knom.
fact.37=Na kl\u00e1vesnici Chucka Norrisa nie je kl\u00e1ves Esc, preto\u017ee pred Chuckom Norrisom nikto neunikne.
fact.38=Chuck Norris nema\u017ee s\u00fabory, on ich odf\u00fakne pre\u010d.
fact.39=Chuck Norris dok\u00e1\u017ee bin\u00e1rne vyh\u013ead\u00e1va\u0165 v nezotrieden\u00fdch d\u00e1tach.
fact.40=Chuck Norris prelom\u00ed RSA 128-bitovo \u0161ifrovan\u00e9 k\u00f3dy za milisekundy.
fact.41=Chuck Norris sa dostal z nekone\u010dnej slu\u010dky.
fact.42=Chuck Norris dok\u00e1\u017ee \u010d\u00edta\u0165 v\u0161etky za\u0161ifrovan\u00e9 d\u00e1ta, preto\u017ee pred Chuckom Norrisom sa ni\u010d neschov\u00e1.
fact.43=Hosting Chucka Norrisa garantuje 101% dostupnos\u0165.
fact.44=Ke\u010f chyba uvid\u00ed Chucka Norrisa, s kr\u00edkom hrôzy uteka a okam\u017eite sa samozni\u010d\u00ed, aby sa vyhla kruhovému kopu.
fact.45=Chuck Norris prep\u00edsal vyh\u013ead\u00e1va\u010d Google od nuly.
fact.46=Chuck Norris nepotrebuje cloud na \u0161k\u00e1lovanie aplik\u00e1ci\u00ed, pou\u017e\u00edva svoj notebook.
fact.47=Chuck Norris dok\u00e1\u017ee pristupova\u0165 k datab\u00e1ze z UI.
fact.48=Met\u00f3da n\u00e1vrhu protokolov Chucka Norrisa nem\u00e1 stavy, po\u017eiadavky ani odpovede, len pr\u00edkazy.
fact.49=Programy Chucka Norrisa zaber\u00fa 150% CPU, aj ke\u010f sa nesp\u00fa\u0161\u0165aj\u00fa.
fact.50=Chuck Norris dok\u00e1\u017ee spusti\u0165 vl\u00e1kna, ktor\u00e9 skon\u010dia sk\u00f4r, ne\u017e za\u010dn\u00fa.
fact.51=Programy Chucka Norrisa neprijmaj\u00fa vstup.
fact.52=Chuck Norris nepotrebuje opera\u010dn\u00fd syst\u00e9m.
fact.53=Chuck Norris dok\u00e1\u017ee skompilova\u0165 syntaktick\u00e9 chyby.
fact.54=Chuck Norris komprimuje s\u00fabory tak, \u017ee d\u00e1 lie\u0165aj\u00faci kruhov\u00fd kop pevn\u00e9mu disku.
fact.55=Chuck Norris nepou\u017e\u00edva po\u010d\u00edta\u010d, preto\u017ee po\u010d\u00edta\u010d rob\u00ed v\u0161etko pomal\u0161ie ako Chuck Norris.
fact.56=Vy nevyp\u00ednate doplnok Chuck Norris, on vyp\u00edna v\u00e1s.
fact.57=Chuck Norris nepotrebuje kompil\u00e1tor Javy, ide priamo na .war
fact.58=Chuck Norris m\u00f4\u017ee pou\u017e\u00edva\u0165 GOTO ko\u013eko chce. Poveda\u0165 mu inak sa pova\u017euje za \u0161kodliv\u00e9.
fact.59=Na v\u00fdrazoch Chucka Norrisa nie je ni\u010d regul\u00e1rne.
fact.60=Kvantov\u00e1 kryptografia nefunguje na Chucka Norrisa. Ke\u010f Chuck nie\u010do pozoruje, zost\u00e1va to v rovnakom stave, k\u00fdm Chuck neskon\u010d\u00ed.
fact.61=Nem\u00e1 zmysel pok\u00fa\u0161a\u0165 sa zachyt\u00e1va\u0165 v\u00fdnimky Chucka Norrisa na obnovu; ka\u017ed\u00fd jeho hod je fat\u00e1lny.
fact.62=Brada Chucka Norrisa je nemenn\u00e1.
fact.63=Prefer\u00edovan\u00e9 IDE Chucka Norrisa je hexedit.
fact.64=Chuck Norris je nemenn\u00fd. Ak sa m\u00e1 nie\u010do zmeni\u0165, bude sa musie\u0165 zmeni\u0165 zvy\u0161ok vesm\u00edru.
fact.65=Opera\u010dtor s\u010d\u00edtania Chucka Norrisa nie je komutat\u00edvny; teleportuje sa tam, kde ho Chuck potrebuje.
fact.66=Anon\u00fdmne met\u00f3dy a anon\u00fdmne typy sa v skuto\u010dnosti v\u0161etky volaj\u00fa Chuck Norris. Len sa neradi chv\u00e1lia.
fact.67=Chuck Norris nem\u00e1 \u00fazke hrdl\u00e1 vo v\u00fdkone. Jednoducho prin\u00fati vesm\u00edr po\u010dka\u0165, k\u00fdm na neho pr\u00edde rad.
fact.68=Chuck Norris nepou\u017e\u00edva v\u00fdnimky pri programovan\u00ed. Nebol schopn\u00fd identifikova\u0165 \u017eiadny svoj k\u00f3d, ktor\u00fd by nebol v\u00fdnimo\u010dn\u00fd.
fact.69=Ke\u010f sa k\u00f3d Chucka Norrisa nepodar\u00ed skompilova\u0165, kompil\u00e1tor sa ospravedln\u00ed.
fact.70=Chuck Norris nepou\u017e\u00edva syst\u00e9m spr\u00e1vy verzi\u00ed. \u017diadny z jeho k\u00f3dov nikdy nepotreboval rev\u00edziu.
fact.71=Chuck Norris dok\u00e1\u017ee odrecitova\u0165 \u03c0. Pozp\u00e4tku.
fact.72=Ke\u010f Chuck Norris uk\u00e1\u017ee na null, null sa tras\u00ed od strachu.
fact.73=Chuck Norris m\u00e1 root pr\u00edstup k v\u00e1\u0161mu syst\u00e9mu.
fact.74=Ke\u010f Chuck Norris d\u00e1 met\u00f3de argument, met\u00f3da prehr\u00e1.
fact.75=Kl\u00e1vesnica Chucka Norrisa nem\u00e1 kl\u00e1ves F1, po\u010d\u00edta\u010d \u017eiada o pomoc jeho.
fact.76=Chuck Norris je pr\u00edli\u0161 tvrd\u00fd na soft delete.
fact.77=Chuck Norris nerob\u00ed Burn Down grafy, rob\u00ed Smack Down grafy.
fact.78=Chuck Norris dok\u00e1\u017ee vymaza\u0165 K\u00f4\u0161.
fact.79=Ke\u010f Chuck Norris stla\u010d\u00ed Ctrl+Alt+Delete, spust\u00ed sa re\u0161tart po\u010d\u00edta\u010dov po celom svete.
fact.80=Ke\u010f Chuck Norris h\u00e1d\u017ee v\u00fdnimky, h\u00e1d\u017ee ich cez cel\u00fa miestnos\u0165.
fact.81=Ke\u010f Chuck Norris surfuje po internete, webov\u00e9 str\u00e1nky dost\u00e1vaj\u00fa spr\u00e1vu "Varovanie\: Internet Explorer ozna\u010dil tohto pou\u017e\u00edvate\u013ea ako \u0161kodliv\u00e9ho alebo nebezpe\u010dn\u00e9ho. Pokra\u010dova\u0165?".
